In [2]:
# Cell 1: Preprocessing and saving transformed data
import pandas as pd

In [3]:
# Load raw data
df = pd.read_csv('data/tested.csv')

In [4]:
# Handle missing values
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Fare'] = df['Fare'].fillna(df['Fare'].mean())
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

In [5]:
# Convert categoricals to dummy variables
df = pd.get_dummies(df, columns=['Sex', 'Embarked'], drop_first=True)

In [7]:
# Save the transformed data
df.to_csv('data/processed_data.csv', index=False)
print(" Data transformed and saved to 'data/processed_data.csv'")

 Data transformed and saved to 'data/processed_data.csv'

In [8]:
# Display the first few rows of the transformed data
df.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_male,Embarked_Q,Embarked_S
0,892,0,3,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,True,True,False
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,NaN,False,False,True
2,894,0,2,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,NaN,True,True,False
3,895,0,3,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,NaN,True,False,True
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,NaN,False,False,True